# AceleraDev Codenation - Semana 2

### Túlio Vieira de Souza | Data Scientist

## Manipulando dados

In [1]:
#Importando os pacotes
import pandas as pd
import numpy as np

In [2]:
#acessando o help dos pacotes
pd?

### Dicionarios

In [3]:
#Criando um dicionário com os dados
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

In [4]:
#para printar o dicionáario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#verificando o tipo do dicionario
type(dados)

dict

In [6]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [7]:
#Acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [8]:
#Acessando uma posicao especifica de um dicionario
dados['acessos'][2]

300

In [9]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][2]

'instagram'

In [10]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

### Listas

In [11]:
type([1,2,3])

list

In [12]:
#Criando uma lista
lista = [200, 200 , 300 ,800, 200]

In [13]:
#printando a lista
lista

[200, 200, 300, 800, 200]

In [14]:
#Vendo valores especificos
lista[1]

200

In [15]:
#fatia da lista
lista[:3]

[200, 200, 300]

In [16]:
# Adicionando a lista ao dicionario 
dados['lista'] = lista

In [17]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [18]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [19]:
#Criar um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [20]:
#acessando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [21]:
#printando os primeiros casos do dataframe
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [22]:
#Verificando o formato do dataframe
dataframe.shape

(5, 5)

In [23]:
QQRNOME = dataframe

In [24]:
QQRNOME.shape

(5, 5)

In [25]:
type(QQRNOME)

pandas.core.frame.DataFrame

In [26]:
#Verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [28]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [29]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [30]:
#Acessando uma coluna especifica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [31]:
# Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [32]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [33]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [34]:
# Removendo colunas
dataframe.drop(columns = ['acessos','site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [35]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [36]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [37]:
#Acessando valores especificos
dataframe['acessos'][1]

200

In [38]:
#Acessando fatia de coluna especifica
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [39]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [40]:
### Fatiando os dados usando o iloc (linhas | colunas)
dataframe.iloc[3:,4:]

   lista  nova_coluna
3    800            4
4    200            5

In [41]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [42]:
#Fatiar os dados usando o loc (indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4

In [43]:
#Selecionando colunas especificas
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [44]:
#Passando os valores atraves de lista
filtro = ['canal_venda', 'acessos']

In [45]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [46]:
# Usando o metodo info()
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
 5   nova_coluna  5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 368.0+ bytes

In [47]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [48]:
#Pivotando os dados (coluna)
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [49]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [50]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [51]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [52]:
# Mudando as colunas usando o comando melt
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [ ]:
#Resetando o indice do dataframe
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

In [ ]:
dataframe

In [ ]:
aux.reset_index()

In [ ]:
aux

In [ ]:
#Exemplo do comando melt
aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

In [ ]:
dataframe

In [ ]:
#Somando as colunas do dataframe
dataframe.sum()

In [ ]:
dataframe

In [ ]:
#Somando as linhas do dataframe
dataframe.sum(axis = 1)

In [ ]:
#Calculando a mediana das colunas numericas
print('Por linha: ',dataframe.median(axis= 1) )
print('Por coluna: ', dataframe.median())

In [ ]:
#Calculando a media das colunas númericas
dataframe.mean()

In [ ]:
#Calculando o desvio padrão das colunas numericas
dataframe.std()

In [ ]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

In [ ]:
#Calculando a moda
dataframe.mode()

In [ ]:
# Valor maximo por coluna
dataframe.max()

In [ ]:
#Valor minimo por coluna
dataframe.min()

In [ ]:
#Printando o numero de unicos
dataframe.nunique()

In [ ]:
#Contando valores unicos de uma coluna
dataframe['canal_venda'].value_counts()

In [ ]:
#Valores unicos de uma coluna
dataframe['canal_venda'].unique()

In [ ]:
# Usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

In [ ]:
# Usando o groupby com valores numericos
dataframe.groupby('canal_venda')['acessos'].median()

In [ ]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].unique()

In [ ]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].first()

In [ ]:
#Usando o groupby com a função agg
dataframe.groupby('canal_venda').agg({'site': 'unique',
                                     'acessos': 'sum'})

In [ ]:
#Correlações entre variaveis
dataframe.corr(method = 'spearman')

In [ ]:
dataframe

In [ ]:
#Criando variaveis categoricas por fatia de variavel numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [ ]:
dataframe

In [ ]:
#Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [ ]:
dataframe

In [ ]:
#Juntando dois dataframes | Criando o dataframe_2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [ ]:
#Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')

In [ ]:
#Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [ ]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [ ]:
dataframe_lido.head()

In [ ]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [ ]:
json['offers'][99]

In [ ]:
json.reset_index(inplace = True)

In [ ]:
json['index']

## Imputação de dados

In [ ]:
df = pd.read_csv('train.csv')

In [ ]:
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})

In [ ]:
aux

In [ ]:
#Dados númericos : média ou mediana
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [ ]:
#Dados categoricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [ ]:
df['Cabin'].value_counts()

In [ ]:
df.shape[0]